def area(a, h): 
    '''
    Принимает два числа:
        a : длина основания треугольника
        h : высота треугольника, проведенная к основанию a
    Возвращает значение площади треугольника
        area(a, h)
    '''
    return a * h / 2 

def perimeter(a, b, c): 
    '''
    Принимает три числа:
        a : длина первой стороны
        b : длина второй стороны
        c : длина третьей стороны
    Возвращает значение периметра треугольника со сторонами a, b, c
        perimeter(a, b, c)
    '''
    return a + b + c 
